Repository: BaCa2-project/BaCa2
Catalog: BaCa2/locale/*/LC_MESSAGES/django.po
Languages: pl

source: Unanimous
pl: Jednogłośne

source: Linear
pl: Liniowe

source: Pending
pl: Oczekuje

source: Accepted
pl: Zaakceptowany

source: Wrong answer
pl: Błąd

source: Time limit exceeded
pl: Przekroczono limit czasu

source: Runtime error
pl: Błąd wykonania

source: Memory exceeded
pl: Przekroczono limit pamięci

source: Compilation error
pl: Błąd kompilacji

source: Rule violation
pl: Naruszenie zasad

source: Unknown extension
pl: Nieznane rozszerzenie

source: Internal timeout
pl: Wewnętrznym limit czasu

source: Internal error
pl: Błąd wewnętrzny

source: Individual Permissions
pl: Uprawnienia użytkowników

source: Group-level Permissions
pl: Uprawnienia grup

source: All Permissions
pl: Wszystkie uprawnienia

source: Doctoral
pl: Doktorant

source: Employee
pl: Pracownik

source: Plain text
pl: Czysty tekst

source: Standard
pl: Standardowe

source: Hidden
pl: Ukryte

source: Control
pl: Kontrolne

source: Best submit
pl: Najlepsze zgłoszenie

source: Last submit
pl: Ostatnie zgłoszenie

source: No fall-off (max points until deadline)
pl: Brak spadku (maksymalne punkty do zakończenia)

source: Linear fall-off
pl: Liniowy spadek

source: Square fall-off
pl: Kwadratowy spadek

source: Polish
pl: Polski

source: English
pl: Angielski

source: Email sent automatically by BaCa2. Please do not reply.
pl: Email wysłany automatycznie przez BaCa2. Proszę nie odpowiadać.

source: Course
pl: Kurs

source: Can view submit code
pl: Może zobaczyć kod zgłoszenia

source: Can view submit compilation logs
pl: Może zobaczyć logi kompilacji zgłoszenia

source: Can view submit checker logs
pl: Może zobaczyć logi sprawdzania zgłoszenia

source: Can view output generated by the student solution
pl: Może zobaczyć wynik generowany przez rozwiązanie studenta

source: Can view benchmark output
pl: Może zobaczyć wynik wzorcowy

source: Can view test inputs
pl: Może zobaczyć dane wejściowe testu

source: Can view used memory
pl: Może zobaczyć zużytą pamięć

source: Can view used time
pl: Może zobaczyć zużyty czas

source: Can rejudge submit
pl: Może ponownie ocenić zgłoszenie

source: Course members
pl: Uczestnicy kursu

source: First name
pl: Imię

source: Last name
pl: Nazwisko

source: Email address
pl: Adres email

source: Role
pl: Rola

source: Roles
pl: Role

source: Role name
pl: Nazwa roli

source: Description
pl: Opis

source: Rounds
pl: Rundy

source: Round name
pl: Nazwa rundy

source: Start date
pl: Data rozpoczęcia

source: End date
pl: Data terminu

source: Deadline date
pl: Data zakończenia

source: Reveal date
pl: Data odsłonięcia

source: Score selection policy
pl: Polityka wyboru wyniku

source: Tasks
pl: Zadania

source: Task name
pl: Nazwa zadania

source: Round
pl: Runda

source: Judging mode
pl: Sposób oceniania

source: Max points
pl: Max punktów

source: My score
pl: Mój wynik

source: Results
pl: Wyniki

source: Submit time
pl: Czas zgłoszenia

source: Submit status
pl: Status zgłoszenia

source: Score
pl: Wynik

source: Submitter first name
pl: Imię zgłaszającego

source: Submitter last name
pl: Nazwisko zgłaszającego

source: Name
pl: Imię

source: Surname
pl: Nazwisko

source: - edit
pl: - edytuj

source: - rounds
pl: - rundy

source: Task
pl: Zadanie

source: User
pl: Użytkownik

source: Fall-off factor
pl: Współczynnik spadku

source: Summary
pl: Podsumowanie

source: Code
pl: Kod

source: Source code
pl: Kod źródłowy

source: Time
pl: Czas

source: Memory
pl: Pamięć

source: Email is not in internal domain. To add external users contact your administrator
pl: Adres email nie jest w domenie wewnętrznej. Aby dodać użytkowników zewnętrznych, skontaktuj się z administratorem

source: Admin role for course leaders
pl: Rola administratora dla liderów kursu

source: course name
pl: nazwa kursu

source: course short name
pl: krótka nazwa kursu

source: Subject code
pl: Nazwa przedmiotu

source: Term code
pl: Kod semestru

source: default role
pl: rola domyślna

source: admin role
pl: rola administratora

source: Can view course members
pl: Może zobaczyć uczestników kursu

source: Can add course members
pl: Może dodać uczestników kursu

source: Can remove course members
pl: Może usunąć uczestników kursu

source: Can change course member's role
pl: Może zmienić rolę uczestnika kursu

source: Can add course admins
pl: Może dodać administratorów kursu

source: Can add course members from CSV
pl: Może dodać uczestników kursu z pliku CSV

source: Can view course role
pl: Może zobaczyć role w kursie

source: Can edit course role
pl: Może edytować role w kursie

source: Can add course role
pl: Może dodawać role w kursie

source: Can delete course role
pl: Może usuwać role w kursie

source: Can view own submits
pl: Może zobaczyć własne zgłoszenia

source: Can add submit after round deadline
pl: Może dodać zgłoszenie po zakończeniu rundy

source: Can add submit before round start
pl: Może dodać zgłoszenie przed rozpoczęciem rundy

source: Can view own results
pl: Może zobaczyć własne wyniki

source: Can reupload task
pl: Może ponownie wgrać paczkę z zadaniem

source: UI theme
pl: Skórka

source: email address
pl: adres email

source: first name
pl: imię

source: last name
pl: nazwisko

source: date joined
pl: data dołączenia

source: user settings
pl: ustawienia użytkownika

source: user job
pl: praca użytkownika

source: superuser status
pl: status superusera

source: Designates that this user has all permissions without explicitly assigning them.
pl: Oznacza, że ten użytkownik ma wszystkie uprawnienia bez ich wyraźnego przypisywania.

source: groups
pl: Grupy

source: The groups this user belongs to. A user will get all permissions granted to each of their groups.
pl: Grupy, do których należy ten użytkownik. Użytkownik otrzyma wszystkie uprawnienia przyznane każdej z grup.

source: roles
pl: Role

source: The course roles this user has been assigned to.
pl: Role w kursie, do których został przypisany ten użytkownik.

source: user permissions
pl: uprawnienia użytkownika

source: Specific permissions for this user.
pl: Dodatkowe uprawnienia przypisane do tego użytkownika.

source: nickname
pl: pseudonim

source: YES
pl: TAK

source: NO
pl: NIE

source: role name
pl: nazwa roli

source: role description
pl: opis roli

source: role permissions
pl: uprawnienia roli

source: course
pl: kurs

source: preset name
pl: nazwa szablonu

source: preset permissions
pl: uprawnienia szablonu

source: preset is public
pl: szablon jest publiczny

source: Indicates whether the preset is public. Public presets can be used by all users, private presets can only be used by their creator or other users given access.
pl: Określa, czy szablon jest publiczny. Publiczne szablony mogą być używane przez wszystkich użytkowników, prywatne szablony mogą być używane tylko przez ich twórcę lub innych użytkowników, którzy otrzymali dostęp.

source: preset creator
pl: twórca szablonu

source: user
pl: użytkownik

source: preset
pl: szablon

source: Login
pl: Logowanie

source: Courses
pl: Kursy

source: Permissions
pl: Uprawnienia

source: Codename
pl: Nazwa kodowa

source: Members
pl: Uczestnicy

source: Profile
pl: Profil

source: Change password
pl: Zmień hasło

source: Password changed.
pl: Hasło zmienione.

source: Password not changed.
pl: Hasło nie zmienione.

source: Attachments
pl: Załączniki

source: Time used:
pl: Użyty czas:

source: Memory used:
pl: Użyta pamięć

source: Compile logs
pl: Logi kompilacji

source: Checker logs
pl: Logi sprawdzania

source: resize
pl: zmień rozmiar

source: Download PDF
pl: Pobierz PDF

source: Download
pl: Pobierz

source: Page
pl: Strona

source: of
pl: z

source: Failed to retrieve data for model instances due to missing mode param.
pl: Nie udało się pobrać danych dla instancji modelu z powodu braku parametru trybu.

source: Get all retrieval mode does not accept filter or exclude parameters.
pl: Tryb pobierania wszystkich nie akceptuje parametrów filtrujących lub wykluczających.

source: Failed to retrieve data for model instances due to invalid get mode parameter.
pl: Nie udało się pobrać danych dla instancji modelu z powodu nieprawidłowego parametru trybu.

source: Permission denied.
pl: Brak uprawnień.

source: Successfully retrieved data for all model instances
pl: Pomyślnie pobrano dane dla wszystkich instancji modelu

source: An error occurred while retrieving data for all model instances.
pl: Podczas pobierania danych dla wszystkich instancji modelu wystąpił błąd.

source: Successfully retrieved data for model instances matching the specified filter parameters.
pl: Pomyślnie pobrano dane dla instancji modelu spełniających określone parametry filtru.

source: An error occurred while retrieving data for model instances matching the specified filter parameters.
pl: Podczas pobierania danych dla instancji modelu spełniających określone parametry filtru wystąpił błąd.

source: This view does not handle post requests.
pl: Ten widok nie obsługuje żądań POST.

source: Unknown form: {request.POST.get("form_name")}
pl: Nieznany formularz: {request.POST.get("form_name")}

source: Compile log
pl: Log kompilacji

source: Checker log
pl: Log sprawdzania

source: Code block
pl: Blok kodu

source: ERROR: Failed to read file. Make sure you have sent valid file as solution.
pl: BŁĄD: Nie udało się odczytać pliku. Upewnij się, że wysłałeś poprawny plik jako rozwiązanie.

source: Form name
pl: Nazwa formularza

source: Form instance
pl: Instancja formularza

source: Action
pl: Akcja

source: Invalid form data. Please correct the following errors:
pl: Nieprawidłowe dane. Proszę poprawić następujące błędy:

source: Request failed due to insufficient permissions.
pl: Żądanie nie powiodło się z powodu niewystarczających uprawnień.

source: Following error occurred while processing the request:
pl: Podczas przetwarzania żądania wystąpił następujący błąd:

source: Submit
pl: Zgłoś

source: Generate automatically
pl: Wygeneruj automatycznie

source: Enter manually
pl: Wprwoadź ręcznie

source: Summary of changes
pl: Podsumowanie zmian

source: No changes made
pl: Brak zmian

source: Course name
pl: Nazwa kursu

source: USOS course code
pl: Kod kursu na USOS

source: USOS term code
pl: Kod semestru na USOS

source: Course
pl: Kurs

source: created successfully
pl: utworzony pomyślnie

source: Add course
pl: Dodaj kurs

source: Add USOS data
pl: Dodaj dane USOS

source: Create without USOS data
pl: Utwórz bez danych USOS

source: Confirm course creation
pl: Potwierdź utworzenie kursu

source: Are you sure you want to create a new course with the following data?
pl: Czy na pewno chcesz utworzyć nowy kurs z następującymi danymi?

source: Create course
pl: Utwórz kurs

source: Course ID
pl: ID kursu

source: Course deleted successfully
pl: Kurs usunięty pomyślnie

source: Delete course
pl: Usuń kurs

source: Confirm course deletion
pl: Potwierdź usunięcie kursu

source: Are you sure you want to delete this course? This action cannot be undone.
pl: Czy na pewno chcesz usunąć ten kurs? Ta akcja nie może być cofnięta.

source: Email from UJ domain, or already registered in the system.
pl: Adres email z domeny UJ, lub już zarejestrowany w systemie.

source: You have been added to a course
pl: Zostałeś dodany do kursu

source: Member added successfully
pl: Uczestnik dodany pomyślnie

source: Add new member
pl: Dodaj nowego uczestnika

source: Members CSV file
pl: Plik CSV z uczestnikami

source: Members added successfully
pl: Uczestnicy dodani pomyślnie

source: Add members from CSV
pl: Dodaj uczestników z pliku CSV

source: Choose members to remove
pl: Wybierz uczestników do usunięcia

source: You cannot remove an admin from the course
pl: Nie możesz usunąć administratora z kursu

source: You cannot remove yourself from the course
pl: Nie możesz usunąć siebie z kursu

source: Members removed successfully
pl: Uczestnicy usunięci pomyślnie

source: Remove members
pl: Usuń uczestników

source: Choose role permissions
pl: Wybierz uprawnienia roli

source: Role
pl: Rola

source: Add role
pl: Dodaj rolę

source: Role ID
pl: ID roli

source: deleted successfully
pl: usunięte pomyślnie

source: Task ID
pl: ID zadania

source: Choose permissions to add
pl: Wybierz uprawnienia do dodania

source: Permissions added successfully
pl: Uprawnienia dodane pomyślnie

source: Add permissions
pl: Dodaj uprawnienia

source: Choose permissions to remove
pl: Wybierz uprawnienia do usunięcia

source: Permissions removed successfully
pl: Upraawnienia usunięte pomyślnie

source: Remove permissions
pl: Usuń uprawnienia

source: Fall-off policy
pl: Polityka spadku punktów

source: Round
pl: Runda

source: Add round
pl: Dodaj rundę

source: edited successfully
pl: edytowana pomyślnie

source: Round ID
pl: ID rundy

source: Round deleted successfully
pl: Runa usunięta pomyślnie

source: If not provided - task name will be taken from package.
pl: Jeśli nie podano - nazwa zadania zostanie pobrana z danych paczki.

source: Points
pl: Punkty

source: If not provided - points will be taken from package.
pl: Jeśli nie podano - punkty zostaną pobrane z danych paczki.

source: Task package
pl: Paczka z zadaniem

source: Only .zip files are allowed
pl: Tylko pliki .zip są dozwolone

source: Judge mode
pl: Tryb oceniania

source: Task
pl: Zadanie

source: Add task
pl: Dodaj zadanie

source: Edit task
pl: Edytuj zadanie

source: Task re-uploaded successfully
pl: Ponowne wgranie zadania zakończyło się sukcesem

source: Re-upload task
pl: Wgraj zadanie ponownie

source: Task deleted successfully
pl: Zadanie usunięte pomyślnie

source: Delete task
pl: Usuń zadanie

source: Confirm task deletion
pl: Potwierdź usunięcie zadania

source: Are you sure you want to delete this task? This action cannot be undone.
pl: Czy na pewno chcesz usunąć to zadanie? Ta akcja nie może być cofnięta.

source: Task title
pl: Nazwa zadania

source: Task judge mode
pl: Tryb oceniania zadania

source: Task points
pl: Punkty za zadanie

source: Memory limit
pl: Limit pamięci

source: Time limit [s]
pl: Limit czasu [s]

source: Allowed extensions
pl: Dozwolone rozszerzenia

source: CPUs
pl: Rdzenie CPU

source: Test set name
pl: Nazwa zestawu testów

source: Test set weight
pl: Waga zestawu testów

source: Test name
pl: Nazwa testu

source: Change input file
pl: Zmień plik wejściowy

source: Change output file
pl: Zmień plik wyjściowy

source: General settings
pl: Ustawienia ogólne

source: Task rejudged successfully - {submits_to_rejudge} submits affected.
pl: Zadanie zostało ocenione ponownie - przetwarzanie {submits_to_rejudge} zgłoszeń.

source: Rejudge task
pl: Oceń zadanie ponownie

source: Confirm task rejudging
pl: Potwierdź ponowne ocenienie zadania

source: Are you sure you want to rejudge this task and all its submits? This may take a while.
pl: Czy na pewno chcesz ocenić ponownie to zadanie i wszystkie jego zgłoszenia? Może to chwilę potrwać.

source: Task rejudged
pl: Zadanie ocenione ponownie

source: Task rejudged successfully.
pl: Ponowne ocenianie zadania zakończyło się sukcesem.

source: Task rejudging failed.
pl: Ponowne ocenianie zadania nie powiodło się

source: Mocking broker is enabled. No submissions will be sent to the broker.
pl: Zaślepka brokera jest włączona. Żadne zgłoszenia nie zostaną wysłane do brokera.

source: Submit created successfully
pl: Zgłoszenie utworzone pomyślnie

source: New submission
pl: Nowe zgłoszenie

source: Submit ID
pl: ID zgłoszenia

source: Submit rejudged successfully
pl: Ponowna ocena zgłoszenia została zainicjowana pomyślnie

source: Rejudge submit
pl: Oceń zgłoszenie ponownie

source: Confirm submit rejudging
pl: Potwierdź ponowną ocenę zgłoszenia

source: Are you sure you want to rejudge this submit?
pl: Czy na pewno chcesz ocenić ponownie to zgłoszenie?

source: This field can only contain the following characters:
pl: To pole może zawierać tylko następujące znaki:

source: This field can only contain alphanumeric characters.
pl: To pole może zawierać tylko znaki alfanumeryczne.

source: This field cannot contain trailing whitespaces.
pl: To pole nie może zawierać końcowych białych znaków.

source: This field cannot contain double spaces.
pl: To pole nie może zawierać podwójnych spacji.

source: This field can only contain alphanumeric characters and spaces.
pl: To pole może zawierać tylko znaki alfanumeryczne i spacje.

source: This field must be a comma-separated list of strings.
pl: To pole musi być listą ciągów znaków oddzielonych przecinkami.

source: This field cannot contain empty strings.
pl: To pole nie może zawierać pustych ciągów znaków.

source: This field must be a comma-separated list of strings from the following list:
pl: To pole musi być listą ciągów znaków oddzielonych przecinkami z następującej listy:

source: This field must be a comma-separated list of integers.
pl: To pole musi być listą liczb całkowitych oddzielonych przecinkami.

source: This field must be a comma-separated list of integers from the following list:
pl: To pole musi być listą liczb całkowitych oddzielonych przecinkami z następującej listy:

source: This field must be a comma-separated list of {self.model.__name__} IDs
pl: To pole musi być listą ID {self.model.__name__} oddzielonych przecinkami

source: Loading...
pl: Ładowanie...

source: This field is required.
pl: To pole jest wymagane.

source: Course name can only contain alphanumeric characters and the following special characters:
pl: Nazwa kursu może zawierać tylko znaki alfanumeryczne i następujące znaki specjalne:

source: Course code
pl: Kod kursu

source: Course with this code already exists.
pl: Kurs o tym kodzie już istnieje.

source: Course code can only contain alphanumeric characters andunderscores.
pl: Kurs może zawierać tylko znaki alfanumeryczne i podkreślenia.

source: USOS code can only contain alphanumeric characters and the following special characters: - + . /
pl: Kod USOS może zawierać tylko znaki alfanumeryczne i następujące znaki specjalne: - + . /

source: This field cannot be empty.
pl: To pole nie może być puste.

source: This field must contain at least
pl: To pole musi zawierać co najmniej

source: This file type is not allowed. Supported file types:
pl: Ten typ pliku nie jest dozwolony. Obsługiwane typy plików:

source: We will send an email with login and password to this address.
pl: Wyślemy e-mail z loginem i hasłem na ten adres.

source: User with this email already exists.
pl: Użytkownik z tym adresem e-mail już istnieje.

source: Your new BaCa2 account
pl: Twoje nowe konto BaCa2

source: User created and email sent.
pl: Użytkownik utworzony i e-mail wysłany.

source: Add new user
pl: Dodaj nowego użytkownika

source: Nickname
pl: Pseudonim

source: Personal data changed.
pl: Dane osobowe zmienione.

source: No changes to apply.
pl: Brak zmian do zastosowania.

source: Nickname is too long.
pl: Pseudonim jest za długi.

source: Nickname is too short.
pl: Pseudonim jest za krótki.

source: Save changes
pl: Zapisz zmiany

source: Confirm record deletion
pl: Potwierdź usunięcie rekordu

source: Are you sure you want to delete this record
pl: Czy na pewno chcesz usunąć ten rekord

source: Dashboard
pl: Pulpit

source: Expand
pl: Rozwiń

source: Collapse
pl: Zwiń

source: Confirm
pl: Potwierdź

source: Cancel
pl: Anuluj

source: Success
pl: Sukces

source: Failure
pl: Błąd

source: No file to display
pl: Brak pliku do wyświetlenia
